变量 年限 = 2019
变量 日期限 = 12300101
变量 开启时间限制 = 1
变量 点击次数 = 0
变量 tn = null
功能 pic_点击()   
    if(开启时间限制 == 1)
        tn = 获取网络时间()
        对话框(tn, "by gxh", 0, 真)
        if(tn == null || tn == "")
            对话框("验证失败1;可能是网络问题", "by gxh", 0, 真)
            退出()
        end
        if(时间年(tn) != 年限)
            对话框("验证失败2;过期禁止使用,前往论坛下载最新版本吧!", "by gxh", 0, 真)
            退出()
        end
        变量 tnm = 时间月(tn), tnd = 时间日(tn), tnh = 时间时(tn), tnmin = 时间分(tn)
        if(字符串长度(tnd) < 2)
            tnd = "0" & tnd
        end
        if(字符串长度(tnh) < 2)
            tnh = "0" & tnh
        end
        if(字符串长度(tnmin) < 2)
            tnmin = "0" & tnmin
        end
        tn = (tnm & tnd & tnh & tnmin)
        tn = 取整(tn)
        if(tn <= 日期限 && tn != "" && tn > 0)
            对话框("验证成功", "by gxh", 0, 真)
            控件打开子窗口("Minecraft全自动钓鱼")
        else
            对话框("过期禁止使用,前往论坛下载最新版本吧!", "by gxh" & tn, 0, 真)
            退出()
        end
    else
        控件打开子窗口("Minecraft全自动钓鱼")
    end 
结束
功能 MC自动钓鱼脚本_初始化()
    if(开启时间限制 == 1)
        tn = 获取网络时间()
        变量 tnm = 时间月(tn), tnd = 时间日(tn), tnh = 时间时(tn), tnmin = 时间分(tn)
        if(字符串长度(tnd) < 2)
            tnd = "0" & tnd
        end
        if(字符串长度(tnh) < 2)
            tnh = "0" & tnh
        end
        if(字符串长度(tnmin) < 2)
            tnmin = "0" & tnmin
        end
        tn = (tnm & tnd & tnh & tnmin)
        tn = 取整(tn)
        if(tn > 日期限 || tn < 0 || tn == null || tn == "" || 时间年(tn) != 年限)
            标签设置颜色("限制", #ff0000)
        end
    else
        控件打开子窗口("Minecraft全自动钓鱼")
    end 
    
    
    
    
    设置托盘("运行", 真)
    变量 事件对象 = 事件打开("MC自动钓鱼脚本开启状态")
    if(事件对象)
        设置托盘气泡("不是已经开了一个吗,这个就帮您关了!", "别开那么多啊!")
        if(对话框("你不是已经打开了吗!开那么多有个卵用啊!", "by gxh", 0, 真))
            退出()
        end
    else
        事件创建(假, 真, "MC自动钓鱼脚本开启状态")
        设置托盘气泡("by gxh", "已经运行")
        变量 txz = 转字符型(日期限)
        if(字符串长度(txz) == 7)
            txz = "0" & txz
        end
        标签设置文本("限制", "时间限制在 " & 年限 & "年" & 字符串截取(txz, 0, 2) & "月" & 字符串截取(txz, 2, 4) & "日" & 字符串截取(txz, 4, 6) & "时" & 字符串截取(txz, 6, 8) & "分 前使用")
    end
    if(开启时间限制 == 0)
        标签设置文本("限制", "")
    end
    //设置托盘("运行",真)
    //变量 开启数量 =字符串查找(枚举窗口("MC自动钓鱼脚本",0),"|",0)
    //if(开启数量 > 0)
    //	设置托盘气泡("不是已经开了一个吗,这个就帮您关了!","别开那么多啊!")
    //	if(对话框("你不是已经打开了吗!开那么多有个卵用啊!","by gxh",0,真))
    //		退出()
    //	end
    //	等待(2500)
    //	退出()
    //else
    //	设置托盘气泡("by gxh","已经运行")
    //end
结束
功能 说明_点击()
    控件打开子窗口("教程")
结束
功能 mcbbs_点击()
    控件打开子窗口("mcbbs")
结束
功能 无聊的按钮_点击()
    点击次数 = 点击次数 + 1
    if(点击次数 == 1)
        按钮设置文本("无聊的按钮", "点什么点!!!")
    elseif(点击次数 == 2)
        按钮设置文本("无聊的按钮", "还点!!!")
    elseif(点击次数 == 3)
        按钮设置文本("无聊的按钮", "难道有什么好东西？")
    elseif(点击次数 == 4)
        按钮设置文本("无聊的按钮", "其实并没有什么啦")
    elseif(点击次数 == 5)
        按钮设置文本("无聊的按钮", "别点啦233!")
    elseif(点击次数 == 6)
        按钮设置文本("无聊的按钮", "真的没东西啊!")
    elseif(点击次数 == 7)
        按钮设置文本("无聊的按钮", "真无聊...")
    elseif(点击次数 == 8)
        按钮设置文本("无聊的按钮", "又没东西.")
    elseif(点击次数 == 9)
        按钮设置文本("无聊的按钮", "真没!!")
    elseif(点击次数 == 10)
        按钮设置文本("无聊的按钮", "你不信算了!")
    elseif(点击次数 == 11)
        按钮设置文本("无聊的按钮", "居然可以继续点!")
    elseif(点击次数 == 12)
        按钮设置文本("无聊的按钮", "你怎么还在点!")
    elseif(点击次数 == 13)
        按钮设置文本("无聊的按钮", "别点啦qwq!")
    elseif(点击次数 == 14)
        按钮设置文本("无聊的按钮", "悄悄告诉你一个秘密!")
    elseif(点击次数 == 15)
        按钮设置文本("无聊的按钮", "算了还是不说了!")
    elseif(点击次数 == 16)
        按钮设置文本("无聊的按钮", "好吧告诉你吧!")
    elseif(点击次数 == 17)
        按钮设置文本("无聊的按钮", "其实啊!")
    elseif(点击次数 == 18)
        按钮设置文本("无聊的按钮", "点我可以看到......")
    elseif(点击次数 == 19)
        按钮设置文本("无聊的按钮", "看到......")
    elseif(点击次数 == 20)
        按钮设置文本("无聊的按钮", "加qq群663934703你就知道啦")//像素彼岸PE服务器审核群
    elseif(点击次数 == 21)
        按钮设置文本("无聊的按钮", "你不信？")
    elseif(点击次数 == 22)
        按钮设置文本("无聊的按钮", "真的!!")
    elseif(点击次数 == 23)
        按钮设置文本("无聊的按钮", "加群663934703吧!")
    elseif(点击次数 == 24)
        按钮设置文本("无聊的按钮", "哈哈哈 其实...")
    elseif(点击次数 == 25)
        按钮设置文本("无聊的按钮", "其实这是一个很好玩的PE服务器!")
    elseif(点击次数 == 26)
        按钮设置文本("无聊的按钮", "是pe的哦!")
    elseif(点击次数 == 27)
        按钮设置文本("无聊的按钮", "有领域一样快的内核!")
    elseif(点击次数 == 28)
        按钮设置文本("无聊的按钮", "来663934703!")
    elseif(点击次数 == 29)
        按钮设置文本("无聊的按钮", "你怎么还在点呀!")
    elseif(点击次数 == 30)
        按钮设置文本("无聊的按钮", "手不酸吗？awa")
    elseif(点击次数 == 31)
        按钮设置文本("无聊的按钮", "不如看看我们服务器的官网？")
    elseif(点击次数 == 32)
        按钮设置文本("无聊的按钮", "来看看吧!")
    else
        点击次数 = 0
        控件打开子窗口("像素彼岸服务器")
    end
    
结束
